Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: ["Gui TreeView control","lib/TreeView.htm"],
ja: ["Gui TreeView コントロール","lib/TreeView.htm"],

source: ["Gui control types","lib/GuiControls.htm"],
ja: ["Guiコントロール","lib/GuiControls.htm"],

source: ["Gui object","lib/Gui.htm"],
ja: ["Guiオブジェクト","lib/Gui.htm"],

source: ["GuiControl Object","lib/GuiControl.htm"],
ja: ["GuiControlオブジェクト","lib/GuiControl.htm"],

source: ["GuiControl object","lib/GuiControl.htm"],
ja: ["GuiControlオブジェクト","lib/GuiControl.htm"],

source: ["Hotkeys and Hotstrings","Hotkeys.htm",
ja: ["ホットキーとホットストリング","Hotkeys.htm",

source: ["Hotkeys","Hotkeys.htm"],
ja: ["ホットキー","Hotkeys.htm"],

source: ["Hotstrings","Hotstrings.htm"],
ja: ["ホットストリング","Hotstrings.htm"],

source: ["Image Handles","misc/ImageHandles.htm"],
ja: ["イメージハンドル","misc/ImageHandles.htm"],

source: ["InputHook Object","lib/InputHook.htm#object"],
ja: ["InputHookオブジェクト","lib/InputHook.htm#object"],

source: ["Install AutoHotkey","howto/Install.htm"],
ja: ["AutoHotkeyのインストール方法","howto/Install.htm"],

source: ["Labels","misc/Labels.htm"],
ja: ["ラベル","misc/Labels.htm"],

source: ["List of Keys","KeyList.htm"],
ja: ["キーリスト","KeyList.htm"],

source: ["Manage Windows","howto/ManageWindows.htm"],
ja: ["ウインドウを管理する方法","howto/ManageWindows.htm"],

source: ["Map Object","lib/Map.htm"],
ja: ["Mapオブジェクト","lib/Map.htm"],

source: ["Maths","lib/Math.htm",
ja: ["算術演算","lib/Math.htm",

source: ["Menu/MenuBar Object","lib/Menu.htm"],
ja: ["Menu/MenuBarオブジェクト","lib/Menu.htm"],

source: ["Menu/MenuBar object","lib/Menu.htm"],
ja: ["Menu/MenuBarオブジェクト","lib/Menu.htm"],

source: ["Misc.","",
ja: ["その他","",

source: ["Monitor","lib/Monitor.htm",
ja: ["モニター","lib/Monitor.htm",

source: ["Mouse and Keyboard","",
ja: ["マウスとキーボード","",

source: ["Object Types","ObjList.htm",
ja: ["オブジェクト型","ObjList.htm",

source: ["Objects","Objects.htm"]
ja: ["オブジェクト","Objects.htm"]

source: ["OnCommand method","lib/GuiOnCommand.htm"],
ja: ["OnCommandメソッド","lib/GuiOnCommand.htm"],

source: ["OnEvent method","lib/GuiOnEvent.htm"],
ja: ["OnEventメソッド","lib/GuiOnEvent.htm"],

source: ["OnNotify method","lib/GuiOnNotify.htm"],
ja: ["OnNotifyメソッド","lib/GuiOnNotify.htm"],

source: ["Process","lib/Process.htm",
ja: ["プロセス","lib/Process.htm",

source: ["Quick Reference","index.htm"],
ja: ["クイックリファレンス","index.htm"],

source: ["Recent Changes","ChangeLog.htm"],
ja: ["直近の変更","ChangeLog.htm"],

source: ["RegExMatch Object","lib/RegExMatch.htm#MatchObject"],
ja: ["RegExMatchオブジェクト","lib/RegExMatch.htm#MatchObject"],

source: ["Registry","",
ja: ["レジストリ","",

source: ["Remapping Keys","misc/Remap.htm"],
ja: ["キーのリマップ","misc/Remap.htm"],

source: ["Run Example Code","howto/RunExamples.htm"],
ja: ["サンプルコードの実行方法","howto/RunExamples.htm"],

source: ["Run Programs","howto/RunPrograms.htm"],
ja: ["プログラムの実行方法","howto/RunPrograms.htm"],

source: ["Screen","",
ja: ["スクリーン","",

source: ["Script Showcase","scripts/index.htm"],
ja: ["スクリプトショーケース","scripts/index.htm"],

source: ["Scripting Language","Language.htm"],
ja: ["スクリプト言語","Language.htm"],

source: ["Scripts (misc)","Scripts.htm"],
ja: ["スクリプト（全般）","Scripts.htm"],

source: ["Send Keystrokes","howto/SendKeys.htm"],
ja: ["キーストロークの送信方法","howto/SendKeys.htm"],

source: ["Sound Functions","lib/Sound.htm"],
ja: ["Sound関数","lib/Sound.htm"],

source: ["Sound","",
ja: ["サウンド","",

source: ["Standard Windows Fonts","misc/FontsStandard.htm"],
ja: ["Windows標準フォント","misc/FontsStandard.htm"],

source: ["String","",
ja: ["文字列","",

source: ["Styles for a window/control","misc/Styles.htm"],
ja: ["ウィンドウとコントロールのスタイル","misc/Styles.htm"],

source: ["Threads","misc/Threads.htm"],
ja: ["スレッド","misc/Threads.htm"],

source: ["Tutorial by tidbit","Tutorial.htm"]
ja: ["ちょっとしたチュートリアル","Tutorial.htm"]

source: ["Tutorials","",
ja: ["チュートリアル","",

source: ["Usage and Syntax","",
ja: ["使い方と文法","",

source: ["Using the Program","Program.htm"],
ja: ["プログラムの使用","Program.htm"],

source: ["Variables and Expressions","Variables.htm"],
ja: ["変数と式","Variables.htm"],

source: ["Window Groups","",
ja: ["ウインドウ・グループ","",

source: ["Window","lib/Win.htm",
ja: ["ウインドウ","lib/Win.htm",

source: ["Write Hotkeys","howto/WriteHotkeys.htm"],
ja: ["ホットキーの書き方","howto/WriteHotkeys.htm"],

source: [Not yet supported]
ja: ［未対応］

source: ^!p::Pause ; Press Ctrl+Alt+P to pause. Press it again to resume.
ja: ^!p::Pause ; Ctrl+Alt+P を押すと一時停止します。もう一度押すと再開します。

source: ^!s:: ; Control+Alt+S hotkey.
ja: ^!s:: ; Control+Alt+S

source: __Call is not called for internal calls to __Enum (formerly _NewEnum) or Call, such as when an object is passed to a for-loop or a function object is being called by SetTimer.
ja: オブジェクトがforループに渡されるときや、SetTimerで関数オブジェクトが呼び出されるときなど、__Enum（旧 _NewEnum）またはCallの内部呼び出しでは__Callは呼び出されません。

source: __Delete is not called for any object which owns a property named "__Class".
ja: __Deleteは、「__Class」というプロパティを所有するオブジェクトに対しては呼び出されません。

source: __Get is used to implement the shorthand match.subpat where subpat is the name of a subpattern/capturing group.
ja: __Getは、match.subpat（subpatはサブパターン/キャプチャグループの名前）という省略法を実装するために使用されます。

source: `a also puts (*BSR_UNICODE) into effect, which causes \R to match any kind of newline.
ja: また、`aは(*BSR_UNICODE)を有効にしており、これにより \Rはどんな改行にもマッチするようになる。

source: a code page with numeric identifier nnn.
ja: 数値識別子nnnを持つコードページです。

source: a function name indicates a failure of that function (not a failure to call the function or evaluate its parameters).
ja: 関数名の場合は、その関数の失敗を示します（関数の呼び出しやパラメータの評価に失敗したわけではありません）。

source: a green icon with a Pause symbol
ja: 緑のアイコンに一時停止マーク

source: a green icon with a transparent H
ja: 透明なHを持つ緑色のアイコン

source: a green icon with a transparent Pause symbol
ja: 緑色のアイコンに透明な一時停止のマーク

source: a negative integer if VersionA is less than VersionB
ja: 負の整数は、VersionAが VersionBより小さい場合

source: a negative integer, if String1 is less than String2
ja: 負の整数、String1が String2より小さい場合

source: a position on the screen, with X and Y properties; a contact in an address book, with Name, PhoneNumber, EmailAddress and so on.
ja: XとYのプロパティを持つ画面上の位置、Name、PhoneNumber、EmailAddressなどのプロパティを持つアドレス帳の連絡先です。

source: a positive integer if VersionA is greater than VersionB
ja: 正の整数は、VersionAが VersionBより大きい場合

source: a positive integer, if String1 is greater than String2
ja: 正の整数, String1が String2より大きい場合

source: a reboot is required to undo the changes or put new ones into effect.
ja: 変更を元に戻したり、新しい変更を有効にするには再起動が必要です。

source: a reference to the InputHook object.
ja: InputHookオブジェクトへの参照。

source: a time half and a date half.
ja: 時間半分、日付半分。

source: a vertical scroll bar, word-wrapping enabled, and Enter captured as part of the input rather than triggering the window's default button.
ja: 垂直スクロールバー、ワードラッピングを有効にし、Enterはウィンドウのデフォルトボタンをトリガーするのではなく、入力の一部としてキャプチャされます。

source: activate(keyname) ; This will be a closure due to app_title and app_path.
ja: activate(keyname) ; app_title と app_path の関係でクローズとなります。

source: adding icons to a ListView's rows will increase the height of each row, which will make this option inaccurate.
ja: ListViewの行にアイコンを追加すると、各行の高さが高くなるため、このオプションは不正確となります。

source: ahk, autohotkey, tutorial, beginners guide
ja: ahk, autohotkey, tutorial, beginners guide, オートホットキー, チュートリアル, 初心者ガイド

source: ahk_ Criteria
ja: ahk_基準

source: ahk_class (Window Class)
ja: ahk_class（ウィンドウクラス）

source: ahk_exe (Process Name/Path)
ja: ahk_exe（プロセス名/パス）

source: ahk_group (Window Group)
ja: ahk_group（窓グループ）

source: ahk_id (Unique ID / HWND)
ja: ahk_id（ユニークID/HWND）

source: ahk_pid (Process ID)
ja: ahk_pid（プロセスID）

source: alert (bell) -- corresponds to Ascii value 7.
ja: alert（ベル） -- Ascii値7に対応。

source: although #HotIf works, it never prevents other programs from seeing the press of a button.
ja: #HotIfは機能しますが、他の番組がボタンを押したところを見ることを防ぐことはできません。

source: an error occurred during the execution of the regular expression.
ja: 正規表現の実行中にエラーが発生しました。

source: an outer and an inner.
ja: 外側と内側。

source: and will be pasted below by sending Ctrl+V.
ja: で、Ctrl+Vを送ると下に貼り付けられます。

source: any day of the week.
ja: 曜日を問わず

source: arr := [{}] ; Creates an array containing an object.
ja: arr := [{}] ; オブジェクトを含んだ配列を作ります。

source: arr.RemoveAt(1) ; Removes and frees the second object.
ja: arr.RemoveAt(1) ; 2番目のオブジェクトを破棄します。

source: arr1[0] := arr2 ; Assign implicit copy.
ja: arr1[0] := arr2 ; 暗黙のコピーを割り当てる。

source: arr1[1] := arr2 ; Assign original array.
ja: arr1[1] := arr2 ; 元の配列を割り当てる。

source: arr1[2] := arr2.Clone() ; Assign explicit copy.
ja: arr1[2] := arr2.Clone() ; 明示的なコピーを割り当てる。

source: arr[1] := {} ; Creates a second object, implicitly freeing the first object.
ja: arr[1] := {} ; 2番目のオブジェクトを生成します。黙示的に最初のオブジェクトを破棄します。

source: assign an integer, such as vref[] := 0.
ja: vref[] := 0のように整数を代入します。

source: assigned to another variable or property, inserted into an array, passed to or returned from a function, etc.
ja: 他の変数やプロパティに代入する、配列に挿入する、関数に渡す、関数から返す、など。

source: auto-replace,autotext,autocorrect,auto text,auto correct,abbreviation expansion,abbreviation,abbreviations,autoreplace,auto replace,text,expander,free,type,typing,word,words
ja: 自動置換、自動テキスト、自動修正、自動テキスト、自動修正、略語展開、略語、自動置換、自動置換、テキスト、エキスパンダー、無料、タイプ、タイピング、単語、言葉

source: b is B and 5 is 5.
ja: b は B で、5 は 5です。

source: backspace
ja: 後退

source: backward POV
ja: 後方視線

source: based on the first line.
ja: を1行目としています。

source: basic usage and examples.
ja: 基本的な使い方と例

source: break ; Nothing to search for, or a match was found.
ja: break ; 検索するものがない、または一致するものが見つかった。

source: break ; Terminate the loop
ja: break ; ループを終了させます

source: break ; Break out of this loop.
ja: break ; このループから抜け出そう。

source: break ; i.e. perform only one loop iteration to fetch the first "field".
ja: break ; つまり、最初の「フィールド」を取得するために1回だけループを反復します。

source: break outer ; Equivalent to break 2 or goto break_outer.
ja: break outer ; ブレーク2またはgoto break_outerに相当します。

source: buf := Buffer(length) ; Allocate temporary buffer.
ja: buf := Buffer(length) ; 一時的なバッファを確保します。

source: b} uses the name "a", as before.
ja: b} は、従来通り「a」という名前を使用します。

source: b} uses the property name in a, instead of taking that as a variable name, performing a double-deref, and using the contents of the resulting variable.
ja: b} は、aのプロパティ名を変数名とし、ダブルデフを行い、結果の変数の内容を使用するのではなく、aのプロパティ名を使用します。

source: b} or {an error:
ja: b} または{an error:

source: b} is equivalent to x := Object(), x.a := b.
ja: b} はx := Object(), x.a := bと等価である。

source: callback := CallbackCreate(TheFunc, "F&", 3) ; Parameter list size must be specified for 32-bit.
ja: callback := CallbackCreate(TheFunc, "F&", 3) ; パラメータリストのサイズは32ビットで指定する必要があります。

source: carriage return (CR)
ja: キャリッジリターン

source: case_conform_btw(hs) ; hs will hold the name of the hotstring which triggered the function.
ja: case_conform_btw(hs) ; hsには、この関数のトリガーとなったホットストリングの名前が入ります。

source: check if it exists; change its priority; close it; wait for it to exist; wait for it to close.
ja: 存在するかどうかを確認する、優先順位を変更する、閉じる、存在するのを待つ、閉じるのを待つ。

source: continue ; Skip unknown LCIDs.
ja: continue ; 不明なLCIDsをスキップします。

source: continue ; Skip this file and move on to the next one.
ja: continue ; このファイルをスキップして、次のファイルに移る。

source: continue ; Skip the below and start a new iteration
ja: continue ; 以下をスキップして、新しい反復を開始します。

source: continue outer ; Equivalent to continue 2 or goto continue_outer.
ja: continue outer ; continue 2またはgoto continue_outerに相当します。

source: continue_outer: ; For goto.
ja: continue_outer: ; goto用

source: create an object and add properties.
ja: オブジェクトを作成し、プロパティを追加する。

source: dbgp_console.ahk: Simple command-line client.
ja: dbgp_console.ahk：シンプルなコマンドラインクライアントです。

source: dbgp_listvars.ahk: Example client which justs lists the variables of all running scripts.
ja: dbgp_listvars.ahk：実行中のスクリプトの変数を一覧表示するだけのクライアント例。

source: dbgp_test.ahk: Demonstrates asynchronous debugging.
ja: dbgp_test.ahk：非同期デバッグのデモを行います。

source: define properties in a shared base object or class.
ja: 共有ベース・オブジェクトまたはクラスのプロパティを定義する。

source: details about limitations.
ja: 制限事項の詳細はこちら

source: e.g. <!a is the same as !a except that only the left Alt will trigger it.
ja: 例：<!a は、左Altだけがトリガーになることを除けば、!a と同じです。

source: e.g. if extra = 2, results will be returned in U_name, U_name1, and U_name2.
ja: 例えば、extra = 2の場合、結果はU_name、U_name1、U_name2で返される。

source: either the specified number of times or until break is encountered.
ja: 指定された回数、またはブレークが発生するまで。

source: either the specified number of times or until a Break statement is encountered.
ja: 指定された回数、またはBreak文に遭遇するまで、そのどちらかを行います。

source: else ; Braces must be used around the section below because it consists of more than one line.
ja: else ; 以下の部分は1行以上からなるため、中括弧を使用する必要があります。

source: else ; Some other extension/file-type, so calculate its unique ID.
ja: else ; 他の拡張子/ファイルタイプなので、そのユニークIDを計算する。

source: else ; Second radio is selected: Resize the image to fit the screen.
ja: else ; 2番目のラジオが選択されている：画面に合わせて画像をリサイズします。

source: else ; Icon successfully loaded.
ja: else ; アイコンの読み込みに成功しました。

source: else ; URLStart has a valid position in it, so compare it with ThisPos.
ja: else ; URLStartには有効な位置が含まれているので、ThisPosと比較します。

source: else defaultFunction() ; i.e. Any single statement can be on the same line with an Else.
ja: else defaultFunction() ; すなわち、任意の1つの文がElseと同じ行に存在することができます。

source: else if (vk = 9) ; Tab
ja: else if (vk = 9) ; タブ

source: empty string.
ja: 空の文字列

source: en
ja: ja

source: etc.
ja: その他

source: explanations of various things you need to know.
ja: さまざまな角度からの解説

source: first retrieve obj.prop, then invoke the default property of the result.
ja: まずobj.propを取得し、次に結果のデフォルト・プロパティを呼び出します。

source: fn(2) ; Shows "1, 2"
ja: fn(2) ; 「1, 2」と表示します

source: fn(2, 0) ; Shows "2, 1, 0"
ja: fn(2, 0) ; 「2, 1, 0」と表示します

source: fn.Call(3) ; Shows "1, 3"
ja: fn.Call(3) ; 「1, 3」と表示します

source: fn.Call(3) ; Shows "3, 1"
ja: fn.Call(3) ; 「3, 1」と表示します

source: fn} to DefineProp, where fn implements the method.
ja: fn} からDefinePropへ、fnはメソッドを実装しています。

source: for GivenPath in A_Args ; For each parameter (or file dropped onto a script):
ja: for GivenPath in A_Args ; 各パラメータ（またはスクリプトにドロップしたファイル）に対して：

source: for n, GivenPath in A_Args ; For each parameter (or file dropped onto a script):
ja: for n, GivenPath in A_Args ; 各パラメータ（またはスクリプトにドロップされたファイル）：

source: for n, param in A_Args ; For each parameter:
ja: for n, param in A_Args ; 各パラメータ：

source: formfeed -- corresponds to Ascii value 12.
ja: formfeed -- Ascii値12に対応。

source: forward POV
ja: 前方視線

source: fraction := Random() ; Equivalent to the line above.
ja: fraction := Random() ; 上の行と同じです。

source: green H icon
ja: 緑のHアイコン

source: green icon with a Pause symbol
ja: 緑のアイコンに一時停止マーク

source: green icon with a transparent H
ja: 緑色のアイコンに透明なH

source: green icon with a transparent Pause symbol
ja: 緑色のアイコンに透明な一時停止マーク

source: greet(subject) ; This will be a closure due to f.
ja: greet(subject) ; これはfによる閉鎖となる。

source: hBrush := DllCall("CreateSolidBrush", "UInt", 0x0000FF, "Ptr") ; Create a red brush (0x0000FF is in BGR format).
ja: hBrush := DllCall("CreateSolidBrush", "UInt", 0x0000FF, "Ptr") ; 赤のブラシ（0x0000FFはBGR形式）を作成します。

source: hDC := DllCall("GetDC", "Ptr", 0, "Ptr") ; Pass zero to get the desktop's device context.
ja: hDC := DllCall("GetDC", "Ptr", 0, "Ptr") ; デスクトップのデバイスコンテキストを取得する場合は、0を渡す。

source: hModule := DllCall("LoadLibrary", "Str", "MyFunctions.dll", "Ptr") ; Avoids the need for DllCall in the loop to load the library.
ja: hModule := DllCall("LoadLibrary", "Str", "MyFunctions.dll", "Ptr") ; ループ内でDllCallしてライブラリを読み込む必要を回避。

source: hProcess := NumGet(pi, 0) ; Defaults to "Ptr".
ja: hProcess := NumGet(pi, 0) ; デフォルトは「Ptr」です。

source: how to write scripts.
ja: スクリプトの書き方

source: iconsize := 32 ; Ideal size for alt-tab varies between systems and OS versions.
ja: iconsize := 32 ; alt-tabの理想的なサイズは、システムやOSのバージョンによって異なる。

source: ie.Visible := true ; This is known to work incorrectly on IE7.
ja: ie.Visible := true ; IE7では正しく動作しないことが確認されています。

source: if !CheckThisRegItem() ; It told us to stop.
ja: if !CheckThisRegItem() ; 停止を指示されました。

source: if !FileExist(Dest "\" A_LoopFileName) ; Always copy if target file doesn't yet exist.
ja: if !FileExist(Dest "\" A_LoopFileName) ; 対象ファイルがまだ存在しない場合は常にコピーします。

source: if !FocusedHwnd ; No focused control.
ja: if !FocusedHwnd ; フォーカスされたコントロールがない。

source: if !IsSet(MyVar) ; Is this the first "use" of MyVar?
ja: if !IsSet(MyVar) ; MyVarの最初の「使用」か？

source: if !ThisPos ; This prefix is disqualified.
ja: if !ThisPos ; このプリフィクスは失格である。

source: if (ItemName = "Open") ; User selected "Open" from the context menu.
ja: if (ItemName = "Open") ; ユーザーはコンテキストメニューから "Open"を選択した。

source: if (MyRadio.Value) ; Display image at its actual size.
ja: if (MyRadio.Value) ; 画像を実際の大きさで表示します。

source: if (cmd = "Reload" or !c.Count) ; Reload when requested or at first call.
ja: if (cmd = "Reload" or !c.Count) ; リクエスト時またはファーストコール時にリロードします。

source: if (count > 0) ; No braces are required around the next line because it's only a single line.
ja: if (count > 0) ; 次の行は1行なので、中括弧は不要です。

source: if (not ImageType) ; IMAGE_BITMAP (0) or the ImageType parameter was omitted.
ja: if (not ImageType) ; IMAGE_BITMAP (0) または ImageType パラメータが省略された場合。

source: if (not OutImageType) ; IMAGE_BITMAP (0) or the OutImageType parameter was omitted.
ja: if (not OutImageType) ; IMAGE_BITMAP (0) または OutImageType パラメータが省略された場合。

source: if (uMsg = 0x0138 && lParam = Text.Hwnd) ; 0x0138 is WM_CTLCOLORSTATIC.
ja: if (uMsg = 0x0138 && lParam = Text.Hwnd) ; 0x0138 は WM_CTLCOLORSTATIC です。

source: if (vk = 8) ; Backspace
ja: if (vk = 8) ; バックスペース

source: if A_LoopField = "" ; Ignore the blank item at the end of the list.
ja: if A_LoopField = "" ; リスト末尾の空白項目は無視します。

source: if A_LoopField = "" ; Omit the last linefeed (blank item) at the end of the list.
ja: if A_LoopField = "" ; リスト末尾のラインフィード（空白項目）を省略します。

source: if A_LoopFileAttrib ~= "[HRS]" ; Skip any file that is either H (Hidden), R (Read-only), or S (System). See ~= operator.
ja: if A_LoopFileAttrib ~= "[HRS]" ; H（Hidden）、R（Read-only）、S（System）のいずれかに該当するファイルをスキップします。~=演算子を参照。

source: if A_LoopRegType = "KEY" ; Remove these two lines if you want to check key names too.
ja: if A_LoopRegType = "KEY" ; 鍵の名前もチェックしたい場合は、この2行を削除してください。

source: if FirstCallToUs ; Create a static array during the first call, but not on subsequent calls.
ja: if FirstCallToUs ; 最初の呼び出し時には静的配列を作成し、それ以降の呼び出し時には作成しない。

source: if IB.Result = "Cancel" ; The user pressed Cancel.
ja: if IB.Result = "Cancel" ; ユーザがキャンセルを押した。

source: if IsSet(Param) ; Pass Param itself, which is an alias for MyVar.
ja: if IsSet(Param) ; MyVarのエイリアスであるParamそのものを渡します。

source: if IsSetRef(Param) ; Pass the VarRef contained by Param.
ja: if IsSetRef(Param) ; Paramが含むVarRefを渡す。

source: if KeepWinZRunning ; This means an underlying thread is already running the loop below.
ja: if KeepWinZRunning ; これは、下層のスレッドがすでに下のループを実行していることを意味します。

source: if MinMax = -1 ; The window has been minimized. No action needed.
ja: if MinMax = -1 ; ウィンドウは最小化されました。何もする必要はない。

source: if SelectedFileName = "" ; No file selected.
ja: if SelectedFileName = "" ; ファイルが選択されていない。

source: if StrGet(buf, 2, "cp0") == "MZ" ; Looks like an executable file...
ja: if StrGet(buf, 2, "cp0") == "MZ" ; 実行ファイルのように見えるが...

source: if not DllCall("IsWindowVisible", "Ptr", WinExist("Untitled - Notepad")) ; WinExist returns an HWND.
ja: if not DllCall("IsWindowVisible", "Ptr", WinExist("Untitled - Notepad")) ; WinExistはHWNDを返す。

source: if not ExtChar ; No more characters.
ja: if not ExtChar ; もう文字がない。

source: if not Folder ; The user canceled the dialog.
ja: if not Folder ; ユーザがダイアログをキャンセルした。

source: if not GetKeyState("Control") ; Neither the left nor right Control key is down.
ja: if not GetKeyState("Control") ; 左右のコントロールキーが押されていない。

source: if not IconNumber ; There is not yet any icon for this extension, so load it.
ja: if not IconNumber ; この拡張機能にはまだアイコンがないので、それを読み込む。

source: if not KeepWinZRunning ; The user signaled the loop to stop by pressing Win-Z again.
ja: if not KeepWinZRunning ; 再びWin-Zを押すことでループを止める合図をした。

source: if not RowNumber ; The above returned zero, so there are no more selected rows.
ja: if not RowNumber ; 上記は0を返したので、もう選択された行はない。

source: if the Program itself is interactive but does not normally print such an announcement, your work based on the Program is not required to print an announcement.)
ja: もし『プログラム』自体が対話的であっても、通常そのようなアナウンスを印刷しないのであれば、『プログラム』に基づくあなたの作品はアナウンスを印刷する必要はありません)。

source: if the capacity is too small, performance is still improved and the variable will begin auto-expanding when the capacity has been exhausted.
ja: 容量が小さすぎる場合でも、パフォーマンスは改善され、容量がなくなると変数は自動拡張を開始する。

source: if time < 0 ; Source file is newer than destination file.
ja: if time < 0 ; ソースファイルはデスティネーションファイルより新しい。

source: if you've found a msg that works on your system (with a certain version of a software) then you can be sure it'll work on another system too with the same version of the software.
ja: もし、あなたのシステムで（あるバージョンのソフトで）動作するメッセージを見つけたのなら、同じバージョンのソフトで他のシステムでも動作することは間違いない。

source: in v1, and := 1 was allowed on its own line but (and := 1) would not work.
ja: v1では、and := 1は、単独で行えたが、(and := 1)は動作しません。

source: it affects all hotkeys and hotstrings between it and the next #InputLevel directive.
ja: は、次の#InputLevel指令との間のすべてのホットキーとホットストリングに影響します。

source: it affects all hotkeys and hotstrings physically beneath it in the script, until the next #HotIf directive.
ja: #HotIfは、次の#HotIfディレクティブまで、スクリプト内で物理的にその下にあるすべてのホットキーとホットストリングに影響を及ぼします。

source: it cannot create remappings specific to a particular user, application, or locale.
ja: 特定のユーザー、アプリケーション、ロケールに特化したリマッピングを作成することはできません。

source: it requires that the current character not be at a word boundary.
ja: この場合、現在の文字が単語境界にないことが必要である。

source: it will be reset at its former period unless a Priority is specified.
ja: は、Priorityが指定されない限り、以前の周期で リセットされます。

source: it will be created with a period of 250.
ja: は250の期間で作成されます。

source: it will not be necessary to check for A_IsCompiled because the code is inside a comment block in the uncompiled script.
ja: このコードは、コンパイルされていないスクリプトのコメント・ブロック内にあるので、A_IsCompiledをチェックする必要はない。

source: joypoll: The hotkey is implemented by polling the controller at regular intervals.
ja: joypoll：ホットキーは、一定間隔でコントローラをポーリングすることで実装されます。

source: just call the SendText function, passing it the exact text you want to send.
ja: SendText関数を呼び出し、送信したいテキストを正確に渡すだけです。

source: k-hook: The hotkey is implemented via the keyboard hook.
ja: k-hook：ホットキーは、キーボードフックを介して実装されます。

source: keyboard,keys,key,keystrokes,clicks,mouse,buttons,button,controller,gamepad,joystick,hotkeys,hotkey,macro
ja: キーボード,キー,キーストローク,クリック,マウス,ボタン,ボタン,コントローラー,ゲームパッド,ジョイスティック,ホットキー,ホットキー,マクロ

source: keyboard,keys,key,mouse,buttons,button,joystick,create,hotkeys,hotkey,macros
ja: キーボード,キー,キー,マウス,ボタン,ボタン,ジョイスティック,作成,ホットキー,ホットキー,マクロ

source: last_line := A_LoopReadLine ; When loop finishes, this will hold the last line.
ja: last_line := A_LoopReadLine ; ループ終了時、最終行を保持します。

source: launch hidden (cannot be used in combination with either of the above)
ja: 隠して起動（上記2つとの併用は不可）

source: launch maximized
ja: 最大化して起動

source: launch minimized
ja: 最小化して起動

source: left POV
ja: 左視点

source: local x, y:=0, z ; Local variables must be declared in this mode, otherwise they would be assumed global.
ja: local x, y:=0, z ; ローカル変数はこのモードで宣言する必要があります。そうしないとグローバル変数とみなされます。

source: m-hook: The hotkey is implemented via the mouse hook.
ja: m-hook：ホットキーは、マウスフックを介して実装されます。

source: macro,macros,keyboard macro,mouse macro
ja: マクロ、マクロ、キーボードマクロ、マウスマクロ

source: methods of GuiControl
ja: GuiControlのメソッドになりました。

source: myGui_Close(thisGui) { ; Declaring this parameter is optional.
ja: myGui_Close(thisGui) { ; このパラメータの宣言は任意です。

source: newline (linefeed/LF)
ja: 改行

source: no angle to report
ja: 触れない

source: obj := "" ; Releases the last reference, and therefore frees the object.
ja: obj := "" ; 最後の参照を解放します。つまり、オブジェクトを破棄します。
